/**/
"Cancel" = "취소";
/**/
"Delete" = "삭제";
/**/
"Open" = "열기";
/**/
"Edit" = "편집";
/**/
"Yes" = "예";
/**/
"Finish" = "마침";
/**/
"Done" = "완료";
/**/
"Save" = "저장";
/**/
"Undo" = "실행 취소";
/**/
"Redo" = "다시 실행";


/*Geometry Edit Action Name*/
"Apply Geometry" = "지오메트리 적용";
/*Geometry Edit Action Name*/
"Clear Geometry" = "지오메트리 해제";
/*Geometry Edit Action Name*/
"Delete Vertex" = "버텍스 삭제";
/*Geometry Edit Action Name*/
"Insert Part" = "파트 삽입";
/*Geometry Edit Action Name*/
"Insert Vertex" = "버텍스 삽입";
/*Geometry Edit Action Name*/
"Move Vertex" = "버텍스 이동";
/*Geometry Edit Action Name*/
"Remove Part" = "파트 제거";

/*Collecting attachments*/
"Add" = "추가";
/*Collecting attachments*/
"Take Photo or Video" = "사진 또는 비디오 촬영";
/*Collecting attachments*/
"Choose From Library" = "라이브러리에서 선택";
/*Collecting attachments*/
"Photo" = "사진";
/*Collecting attachments*/
"Video" = "비디오";
/*Collecting attachments*/
"Save To Photo Library" = "사진 라이브러리에 저장";
/*Collecting attachments*/
"Download" = "다운로드";

/*Date attribute*/
"Today" = "오늘";

/**/
"Attachments" = "첨부 파일";
"Attributes" = "속성";

/**/
"Open in Safari" = "Safari에서 열기";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "%i에서 %i 사이의 숫자를 입력하세요.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "%@에서 %@ 사이의 숫자를 입력하세요.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "문자 수(%@)가 너무 많음";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "숫자가 허용 범위를 벗어났습니다.";

/* BLOB, RASTER, etc */
"Field type not supported" = "필드 유형이 지원되지 않음";

/**/
"%d of %d" = "%d/%d";

/**/
"Changing Feature Type" = "피처 유형 변경";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "피처 유형을 변경하려고 합니다. 피처 유형을 변경하면 일부 필드 값이 덮어써질 수 있습니다. 피처 유형을 변경하시겠습니까?";

/**/
"Data for pie chart is invalid" = "파이 차트 데이터가 올바르지 않습니다.";
"No data to create a pie chart" = "파이 차트를 만들 데이터가 없습니다.";

/**/
"Created by %@ seconds ago" = "몇 초 전에 %@에 의해 생성됨";

/**/
"Created by %@ a minute ago" = "1분 전에 %@에 의해 생성됨";

/**/
"Edited by %@ seconds ago" = "몇 초 전에 %@에 의해 편집됨";

/**/
"Edited by %@ a minute ago" = "1분 전에 %@에 의해 편집됨";

/**/
"Created seconds ago" = "몇 초 전에 생성됨";

/**/
"Created a minute ago" = "1분 전에 생성됨";

/**/
"Edited seconds ago" = "몇 초 전에 편집됨";

/**/
"Edited a minute ago" = "1분 전에 편집됨";

/**/
"Created by %@ %d minutes ago" = "%@에 의해 %d분 전에 생성됨";

/**/
"Created by %@ an hour ago" = "%@에 의해 한 시간 전에 생성됨";

/**/
"Created by %@ %d hours ago" = "%@에 의해 %d시간 전에 생성됨";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "%@에 의해 %@, %@에 생성됨";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "%@에 의해 %@, %@에 생성됨";

/**/
"Edited by %@ %d minutes ago" = "%@에 의해 %d분 전에 편집됨";

/**/
"Edited by %@ an hour ago" = "%@에 의해 한 시간 전에 편집됨";

/**/
"Edited by %@ %d hours ago" = "%@에 의해 %d시간 전에 편집됨";

/**/
"Edited by %@ on %@ at %@ - day" = "%@에 의해 %@, %@에 편집됨";

/**/
"Edited by %@ on %@ at %@ - full" = "%@에 의해 %@, %@에 편집됨";

/**/
"Created by %@" = "%@에 의해 생성됨";

/**/
"Edited by %@" = "%@에 의해 편집됨";

/**/
"Created %d minutes ago" = "%d분 전에 생성됨";

/**/
"Created an hour ago" = "한 시간 전에 생성됨";

/**/
"Created %d hours ago" = "%d시간 전에 생성됨";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "%@, %@에 생성됨";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "%@, %@에 생성됨";

/**/
"Edited %d minutes ago" = "%d분 전에 편집됨";

/**/
"Edited an hour ago" = "한 시간 전에 편집됨";

/**/
"Edited %d hours ago" = "%d시간 전에 편집됨";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "%@, %@에 편집됨";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "%@, %@에 편집됨";

/* Used to denote a required field */
"Required" = "필수 사항";

/* Used for naming layers with no names */
"Layer %d" = "%d 레이어";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "위치에 대한 주소를 찾을 수 없습니다.";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "주소에 대한 위치를 찾을 수 없습니다.";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "주소를 읽을 수 없습니다.";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "파일을 찾을 수 없습니다.";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "로케이터를 로드할 수 없습니다.";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "로케이터 내부 오류";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "교차로 지오코딩은 로케이터에서 지원되지 않습니다.";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "잘못된 로케이터 등록정보";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "필수 필드가 누락되었습니다.";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "로케이터가 초기화되지 않았습니다.";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "지원되지 않는 로케이터 형식";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "지원되지 않는 투영 변환";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "지원되지 않는 공간 참조";

/* Network analyst errors */
"Cannot open network." = "네트워크를 열 수 없습니다.";
"Cannot retrieve route task parameters." = "경로 작업 매개변수를 검색할 수 없습니다.";
"Insufficient number of stops." = "경유지 수가 부족합니다.";
"Stop (%@) was not located." = "경유지(%@)를 찾을 수 없습니다.";
"Stop (%@) is located on a non traversable element." = "경유지(%@)가 통과할 수 없는 요소에 있습니다.";
"Stop (%@) is located on a soft restricted element." = "경유지(%@)가 소프트 제한 요소에 있습니다.";
"Point barrer (%@) was not located." = "포인트 경계(%@)를 찾지 못했습니다.";
"Point barrier (%@) has invalid added cost attribute name." = "포인트 경계(%@)에 잘못 추가된 비용 속성 이름이 있습니다.";
"Line barrier (%@) has invalid scaled cost attribute name." = "라인 경계(%@)에 잘못된 축적의 비용 속성 이름이 있습니다.";
"Line barrier (%@) does not cover any network elements." = "라인 경계(%@)에 네트워크 요소가 포함되어 있지 않습니다.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "폴리곤 경계(%@)에 잘못된 축적의 비용 속성 이름이 있습니다.";
"Polygon barrier (%@) does not cover any network elements." = "포인트 경계(%@)에 네트워크 요소가 포함되어 있지 않습니다.";
"'%@' is an invalid impedance attribute." = "'%@'은(는) 잘못된 임피던스 속성입니다.";
"'%@' restriction attribute is invalid." = "'%@' 제한 속성이 잘못되었습니다.";
"'%@' accumulate attribute is invalid." = "'%@' 누적 속성이 잘못되었습니다.";
"'%@' is an invalid directions time attribute." = "'%@'은(는) 잘못된 방향 시간 속성입니다.";
"Directions distance attribute is invalid." = "방향 거리 속성이 잘못되었습니다.";
"Invalid attribute parameter attribute name (%@)." = "속성 매개변수 속성 이름(%@)이 잘못되었습니다.";
"Invalid attribute parameter parameter name (%@)." = "속성 매개변수 매개변수 이름(%@)이 잘못되었습니다.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "속성(%1$@) 매개변수(%2$@)의 값 유형이 잘못되었습니다.";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "속성(%1$@) 매개변수(%2$@)의 제한 사용 값이 잘못되었습니다.";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "속성(%1$@) 매개변수(%2$@)의 중립 제한 사용 값이 잘못되었습니다.";
"Soft restricted element (%@) was traversed." = "소프트 제한 요소(%@)를 통과했습니다.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "네트워크에 계층적 경로 계획을 수행할 수 있는 계층 구조 속성이 없습니다.";
"No path can be found between a given pair of stops (%@)." = "지정한 경유지 쌍(%@) 사이에서 찾을 수 있는 경로가 없습니다.";
"The input spatial reference is undefined." = "입력 공간 참조가 정의되어 있지 않습니다.";
"The output spatial reference is undefined." = "출력 공간 참조가 정의되어 있지 않습니다.";
"The directions style is invalid." = "방향 스타일이 잘못되었습니다.";
"The directions language is invalid." = "방향 언어가 잘못되었습니다.";
"Directions time and distance attributes do not match." = "방향 시간 및 거리 속성이 일치하지 않습니다.";
"The directions road class attribute is invalid." = "방향 도로 클래스 속성이 잘못되었습니다.";
"Unknown condition." = "조건을 알 수 없습니다.";
"Invalid route task parameters." = "잘못된 경로 작업 매개변수입니다.";
"Route task's solution cannot be found." = "경로 작업의 솔루션을 찾을 수 없습니다.";
"Route task was cancelled." = "경로 작업이 취소되었습니다.";
"Route task internal error." = "경로 작업 내부 오류입니다.";
"Route name property is not supported for local route task." = "경로 이름 등록정보가 로컬 경로 작업에 지원되지 않습니다.";
"Local route task parameters should be retrieved from route task." = "경로 작업에서 로컬 경로 작업 매개변수를 검색해야 합니다.";
"Cannot retrieve network description." = "네트워크 설명을 검색할 수 없습니다.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "impedanceAttributeName 및 accumulateAttributeNames에 대해 하나의 길이 속성만 지정할 수 있습니다.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "impedanceAttributeName 및 accumulateAttributeNames에 대해 하나의 시간 속성만 지정할 수 있습니다.";
"Service not supported." = "서비스가 지원되지 않습니다.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "피트";
"in" = "in";
"km" = "킬로미터";
"m" = "미터";
"mi" = "마일";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "알 수 없음";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "센티미터";
"Decimal Degrees" = "십진 각도";
"Decimeters" = "데시미터";
"Feet" = "피트";
"Inches" = "인치";
"Kilometers" = "킬로미터";
"Meters" = "미터";
"Miles" = "마일";
"Millimeters" = "밀리미터";
"Nautical Miles" = "해리";
"Points" = "포인트";
"Yards" = "야드";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "sq. mm";
"sq. cm" = "sq. cm";
"sq. dm" = "sq. dm";
"sq. m" = "sq. m";
"ares" = "아르";
"ha" = "ha";
"sq. km" = "sq. km";

/* Area Units Display Strings */
"Square Inches" = "평방 인치";
"Square Feet" = "제곱피트";
"Square Yards" = "평방 야드";
"Acres" = "에이커";
"Square Miles" = "제곱마일";
"Square Millimeters" = "평방 밀리미터";
"Square Centimeters" = "평방 센티미터";
"Square Decimeters" = "평방 데시미터";
"Square Meters" = "제곱미터";
"Ares" = "아르";
"Hectares" = "헥타르";
"Square Kilometers" = "제곱킬로미터";

/* Errors */
"Class not @protocol AGSCoding compliant" = "클래스가 @protocol AGSCoding과 호환되지 않습니다.";
"Authorization required" = "권한 필요";
"Token is invalid or has expired" = "토큰이 잘못되었거나 만료되었습니다.";
"Unknown error occurred" = "알 수 없는 오류가 발생했습니다.";
"Empty username/password" = "사용자 이름/암호가 비어 있습니다.";
"Token URL is nil. You must set a valid token URL on the credential." = "토큰 URL이 nil입니다. 자격 증명에서 유효한 토큰 URL을 설정해야 합니다.";
"Unknown authentication error" = "알 수 없는 인증 오류";
"Error extracting identity" = "ID를 추출하는 동안 오류가 발생했습니다.";
"Error adding identity to the keychain" = "키체인에 ID를 추가하는 동안 오류가 발생했습니다.";
"Invalid Credentials" = "잘못된 자격 증명";
"Bad URL." = "URL이 잘못되었습니다.";
"The feature layer does not expose an object-id field." = "이 피처 레이어는 object-id 필드에 표시되지 않습니다.";
"Both geodatabase and syncParams are required for this method." = "이 메쏘드에는 지오데이터베이스와 syncParams가 둘 다 필요합니다.";
"Uploading deltas is not supported with this replica." = "이 복제본에서는 델타 업로드가 지원되지 않습니다.";
"Error creating delta geodatabase" = "델타 지오데이터베이스를 생성하는 동안 오류가 발생했습니다.";
"Unable to create result image layer" = "결과 이미지 레이어를 생성할 수 없습니다.";
"Cache at path '%@' not found." = "경로 '%@'에서 캐시를 찾을 수 없습니다.";
"To add an item, you must be logged in to the portal." = "항목을 추가하려면 포털에 로그인해야 합니다.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "항목을 추가하려면 AGSPortalItemContentParameters 값을 지정해야 합니다.";
"The portal failed to add the item." = "포털에서 항목을 추가하지 못했습니다.";
"To delete an item, you must be logged in to the portal." = "항목을 삭제하려면 포털에 로그인해야 합니다.";
"The portal failed to delete the item." = "포털에서 항목을 삭제하지 못했습니다.";
"To update an item, an itemId and logged in user are required." = "항목을 업데이트하려면 itemId와 로그인한 사용자가 필요합니다.";
"The item failed to update." = "항목을 업데이트하지 못했습니다.";
"The item failed to update JSON." = "항목에서 JSON을 업데이트하지 못했습니다.";
"You must be logged in to a portal to add a comment." = "설명을 추가하려면 포털에 로그인해야 합니다.";
"The comment failed to be added." = "설명을 추가하지 못했습니다.";
"You must be logged in to a portal to fetch the current user's rating." = "현재 사용자의 등급을 가져오려면 포털에 로그인해야 합니다.";
"You must be logged in to a portal to add a rating." = "등급을 추가하려면 포털에 로그인해야 합니다.";
"The rating failed to be added." = "등급을 추가하지 못했습니다.";
"To share an item, you must be logged in to the portal." = "항목을 공유하려면 포털에 로그인해야 합니다.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "항목의 공유를 취소하려면 포털에 로그인하여 항목의 공유를 취소할 그룹을 지정해야 합니다.";
"Bad Request" = "잘못된 요청";
"Credential Required" = "AGSCredential 필요";
"Job not created" = "작업을 생성하지 못했습니다.";
"Service did not return a valid URL" = "서비스에서 유효한 URL을 반환하지 않았습니다.";
"Service did not return a file" = "서비스에서 파일을 반환하지 않았습니다.";
"Service did not return a size" = "서비스에서 크기를 반환하지 않았습니다.";
"Job failed" = "작업에 실패했습니다.";
"Job timed out" = "작업 시간이 초과되었습니다.";
"Job was cancelled" = "작업이 취소되었습니다.";
"Job was deleted" = "작업이 삭제되었습니다.";

/* OAuth */
"The specified clientID is invalid" = "지정한 clientID가 유효하지 않습니다.";











